app/views/inventory_foods/new.html.erb

  <p>Choose food from this list (press cntrl+click to select multiple)</p>
  <%= form.select :food_list, Food.order(:name).where(user_id:current_user.id).pluck(:name, :id), {}, {:multiple => true, required:true} %>
---
SELECT "foods"."name", "foods"."id" FROM "foods" WHERE "foods"."user_id" = $1 ORDER BY "foods"."name" ASC  [["user_id", 1]]