app/controllers/inventory_foods_controller.rb

SELECT "inventory_foods".* FROM "inventory_foods" WHERE "inventory_foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "inventory_foods" WHERE "inventory_foods"."id" = $1  [["id", 1]]
---
  def destroy
    @inventory_food = InventoryFood.find_by(id: params[:food_id])

    if @inventory_food.destroy

SELECT "inventories".* FROM "inventories" WHERE "inventories"."user_id" = $1 AND "inventories"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 5], ["LIMIT", 1]]
---
  def new
    @inventory = current_user.inventories.find(params[:id])

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "inventory_foods" ("quantity", "inventory_id", "food_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["quantity", 2], ["inventory_id", 5], ["food_id", 1], ["created_at", "2022-09-06 21:56:51.327069"], ["updated_at", "2022-09-06 21:56:51.327069"]]
---
  def create
    food_list = params[:inventory_food][:food_list]
    food_list = food_list.drop(1)
    food_list.each do |food|
      quantity = Food.find(food.to_i).quantity
      new_inventory_food = InventoryFood.new(food_id: food.to_i, quantity:, inventory_id: params[:id])
      new_inventory_food.save