app/controllers/inventories_controller.rb

SELECT "inventories".* FROM "inventories" WHERE "inventories"."user_id" = $1 AND "inventories"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "inventory_foods".* FROM "inventory_foods" WHERE "inventory_foods"."inventory_id" = $1  [["inventory_id", 5]]
---
  def show
    @user = current_user
    @inventory = @user.inventories.find(params[:id])
    @foods = @inventory.inventory_foods.includes(:food)

INSERT INTO "inventories" ("name", "user_id", "created_at", "updated_at", "description") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "inv1"], ["user_id", 1], ["created_at", "2022-09-06 17:11:11.474428"], ["updated_at", "2022-09-06 17:11:11.474428"], ["description", "lorem"]]
---
  def create
    @inventory = Inventory.new(inventory_params)
    @inventory.user_id = current_user.id

    render :new unless @inventory.save

SELECT "inventories".* FROM "inventories" WHERE "inventories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "inventories" WHERE "inventories"."id" = $1  [["id", 2]]
---
  def destroy
    @inventory = Inventory.find_by(id: params[:id])

    if @inventory.destroy